WikDra/esp32-hid-gamepad-bridge/firmware/sdkconfig.defaults.esp32h2
# ESP32-H2-DevKitM-1.
#
# Why this board is in the picture at all: the MuseLab nanoESP32-C6 hears the AULA F99 Pro
# roughly 15-20 dB weaker than the C3 SuperMini does, measured with the board physically
# TOUCHING the keyboard and with the keyboard in genuine pairing mode - so the deficit is
# not distance and not the device's mode (AGENTS.md 4.35). The pad and the mouse work on
# that board; only the keyboard, which sits further down the link budget, does not. This is
# an official Espressif devkit, so its RF layout is a known quantity rather than a guess.
#
# The H2 also fits this project better on paper than the C6: it is a BLE-and-802.15.4 part
# with NO Wi-Fi, so there is no Wi-Fi/BLE coexistence arbitration sharing the radio at all.
CONFIG_IDF_TARGET="esp32h2"

# Console on USB Serial/JTAG ONLY, and this is not a preference - it is a hard requirement
# of the split bridge. Our inter-chip link runs on UART1 remapped to GPIO24/23, which are
# this chip's DEFAULT UART0 pins, because that is how the BR board wires the H2 to the S3.
# Leaving the console on UART0 would put log text on the very same wire, with two peripherals
# driving one pin and every log line landing in the S3's receiver. The board gives the H2 its
# own USB socket (confirmed on hardware: VID_303A&PID_1001, i.e. the chip's native USB), so
# nothing is lost.
#
# For the H2-DevKitM-1, which has a CH343 bridge on one of its two sockets, the main branch
# sets UART as primary instead - see the note there. This file targets the BR board.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ---------------------------------------------------------------- split bridge: satellite
#
# This chip serves the MOUSE ONLY and forwards its reports to the S3 over UART. No pad here,
# so no peripheral role and no mapper: the S3 owns the pad and makes every decision.
CONFIG_APP_ENABLE_HID_HOST=y
CONFIG_APP_ENABLE_GAMEPAD=n
CONFIG_APP_HID_WANT_KEYBOARD=n
CONFIG_APP_HID_WANT_MOUSE=y
CONFIG_APP_LINK_SENDER=y

# Ask for the shortest interval; the ladder settles on whatever the controller grants. Worth
# trying 6 here because THIS is the newer controller family, and the 15 ms floor we measured
# was on the old one (AGENTS.md 4.33) - the C6/H2 pair happily ran the inputs at 7.5 ms.
CONFIG_APP_INPUT_CONN_ITVL=6

# NOTE ON THE CONTROLLER: like the C6, the H2 uses the BT_LE_* controller option namespace
# rather than the C3's BT_CTRL_*. The AGENTS.md 4.28 fix (arrays in ble_gap.c indexed by
# conn_handle but dimensioned by the connection count) is host-side, so it applies here
# unchanged through BT_NIMBLE_MAX_CONNECTIONS in the shared sdkconfig.defaults.
#
# The H2 has no Bluetooth Classic at all, which costs us nothing: this project is BLE only.
